<?xml version="1.0" ?>
<net name="vehicle-attributes-recognition-barrier-0042" version="10">
	<layers>
		<layer id="0" name="input" type="Parameter" version="opset1">
			<data element_type="f16" shape="1,3,72,72"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="input/reverse_input_channels5760/Concat5779_const133_const" type="Const" version="opset1">
			<data element_type="f16" offset="0" shape="1,3,1,1" size="6"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Mul_/Fused_Mul_" type="Multiply" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="input/reverse_input_channels5762/Concat5787_const135_const" type="Const" version="opset1">
			<data element_type="f16" offset="6" shape="1,3,1,1" size="6"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Add_/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="882886_const" type="Const" version="opset1">
			<data element_type="f16" offset="12" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="6" name="883887_const" type="Const" version="opset1">
			<data element_type="f16" offset="14" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="7" name="884888_const" type="Const" version="opset1">
			<data element_type="f16" offset="12" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="8" name="885889_const" type="Const" version="opset1">
			<data element_type="f16" offset="14" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="9" name="127/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="127/fq_weights_1/Convert_to_float/Cast_02366_const" type="Const" version="opset1">
			<data element_type="u8" offset="16" shape="64,3,7,7" size="9408"/>
			<output>
				<port id="1" precision="U8">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="127/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="127/fq_weights_1/Copy/out_low1998_const" type="Const" version="opset1">
			<data element_type="f16" offset="9424" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="127/fq_weights_1/Copy/out_high1999_const" type="Const" version="opset1">
			<data element_type="f16" offset="9426" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="894898_const" type="Const" version="opset1">
			<data element_type="f16" offset="9428" shape="64,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="895899_const" type="Const" version="opset1">
			<data element_type="f16" offset="9556" shape="64,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="127/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="127" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="3,3" pads_end="3,3" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>72</dim>
					<dim>72</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>3</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="data_add_37073712/copy_const139_const" type="Const" version="opset1">
			<data element_type="f16" offset="9684" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="128/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="129" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="13161320_const" type="Const" version="opset1">
			<data element_type="f16" offset="9424" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="22" name="13171321_const" type="Const" version="opset1">
			<data element_type="f16" offset="9812" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="23" name="13181322_const" type="Const" version="opset1">
			<data element_type="f16" offset="9424" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="24" name="13191323_const" type="Const" version="opset1">
			<data element_type="f16" offset="9812" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="25" name="130/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="130" type="MaxPool" version="opset1">
			<data kernel="3,3" pads_begin="1,1" pads_end="1,1" rounding_type="floor" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>36</dim>
					<dim>36</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="131/fq_weights_1/Convert_to_float/Cast_02342_const" type="Const" version="opset1">
			<data element_type="u8" offset="9814" shape="64,64,3,3" size="36864"/>
			<output>
				<port id="1" precision="U8">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="131/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="131/fq_weights_1/Copy/out_low1990_const" type="Const" version="opset1">
			<data element_type="f16" offset="9424" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="131/fq_weights_1/Copy/out_high1991_const" type="Const" version="opset1">
			<data element_type="f16" offset="9426" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="584588_const" type="Const" version="opset1">
			<data element_type="f16" offset="46678" shape="64,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="585589_const" type="Const" version="opset1">
			<data element_type="f16" offset="46806" shape="64,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="131/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="131" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="data_add_37153720/copy_const145_const" type="Const" version="opset1">
			<data element_type="f16" offset="46934" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="132/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="133" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="662666_const" type="Const" version="opset1">
			<data element_type="f16" offset="9424" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="39" name="663667_const" type="Const" version="opset1">
			<data element_type="f16" offset="47062" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="40" name="664668_const" type="Const" version="opset1">
			<data element_type="f16" offset="9424" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="41" name="665669_const" type="Const" version="opset1">
			<data element_type="f16" offset="47062" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="42" name="134/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="134/fq_weights_1/Convert_to_float/Cast_02346_const" type="Const" version="opset1">
			<data element_type="u8" offset="47064" shape="64,64,3,3" size="36864"/>
			<output>
				<port id="1" precision="U8">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="134/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="134/fq_weights_1/Copy/out_low1910_const" type="Const" version="opset1">
			<data element_type="f16" offset="9424" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="134/fq_weights_1/Copy/out_high1911_const" type="Const" version="opset1">
			<data element_type="f16" offset="9426" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="674678_const" type="Const" version="opset1">
			<data element_type="f16" offset="83928" shape="64,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="675679_const" type="Const" version="opset1">
			<data element_type="f16" offset="84056" shape="64,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="134/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="134" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="data_add_37233728/copy_const150_const" type="Const" version="opset1">
			<data element_type="f16" offset="84184" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="135/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="512516_const" type="Const" version="opset1">
			<data element_type="f16" offset="84312" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="54" name="513517_const" type="Const" version="opset1">
			<data element_type="f16" offset="84314" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="55" name="514518_const" type="Const" version="opset1">
			<data element_type="f16" offset="84312" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="56" name="515519_const" type="Const" version="opset1">
			<data element_type="f16" offset="84314" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="57" name="136/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="136" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="137" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="412416_const" type="Const" version="opset1">
			<data element_type="f16" offset="9424" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="61" name="413417_const" type="Const" version="opset1">
			<data element_type="f16" offset="84316" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="62" name="414418_const" type="Const" version="opset1">
			<data element_type="f16" offset="9424" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="63" name="415419_const" type="Const" version="opset1">
			<data element_type="f16" offset="84316" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="64" name="138/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="138/fq_weights_1/Convert_to_float/Cast_02376_const" type="Const" version="opset1">
			<data element_type="u8" offset="84318" shape="64,64,3,3" size="36864"/>
			<output>
				<port id="1" precision="U8">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="138/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="138/fq_weights_1/Copy/out_low1950_const" type="Const" version="opset1">
			<data element_type="f16" offset="9424" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="138/fq_weights_1/Copy/out_high1951_const" type="Const" version="opset1">
			<data element_type="f16" offset="9426" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="424428_const" type="Const" version="opset1">
			<data element_type="f16" offset="121182" shape="64,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="425429_const" type="Const" version="opset1">
			<data element_type="f16" offset="121310" shape="64,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="138/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="138" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="data_add_37313736/copy_const156_const" type="Const" version="opset1">
			<data element_type="f16" offset="121438" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="139/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="140" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="632636_const" type="Const" version="opset1">
			<data element_type="f16" offset="9424" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="77" name="633637_const" type="Const" version="opset1">
			<data element_type="f16" offset="121566" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="78" name="634638_const" type="Const" version="opset1">
			<data element_type="f16" offset="9424" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="79" name="635639_const" type="Const" version="opset1">
			<data element_type="f16" offset="121566" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="80" name="141/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="141/fq_weights_1/Convert_to_float/Cast_02360_const" type="Const" version="opset1">
			<data element_type="u8" offset="121568" shape="64,64,3,3" size="36864"/>
			<output>
				<port id="1" precision="U8">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="141/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="141/fq_weights_1/Copy/out_low2038_const" type="Const" version="opset1">
			<data element_type="f16" offset="9424" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="141/fq_weights_1/Copy/out_high2039_const" type="Const" version="opset1">
			<data element_type="f16" offset="9426" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="644648_const" type="Const" version="opset1">
			<data element_type="f16" offset="158432" shape="64,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="645649_const" type="Const" version="opset1">
			<data element_type="f16" offset="158560" shape="64,1,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="141/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="141" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="data_add_37393744/copy_const161_const" type="Const" version="opset1">
			<data element_type="f16" offset="158688" shape="1,64,1,1" size="128"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="142/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="862866_const" type="Const" version="opset1">
			<data element_type="f16" offset="158816" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="92" name="863867_const" type="Const" version="opset1">
			<data element_type="f16" offset="158818" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="93" name="864868_const" type="Const" version="opset1">
			<data element_type="f16" offset="158816" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="94" name="865869_const" type="Const" version="opset1">
			<data element_type="f16" offset="158818" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="95" name="143/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="143" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="144" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="782786_const" type="Const" version="opset1">
			<data element_type="f16" offset="9424" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="99" name="783787_const" type="Const" version="opset1">
			<data element_type="f16" offset="158820" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="100" name="784788_const" type="Const" version="opset1">
			<data element_type="f16" offset="9424" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="101" name="785789_const" type="Const" version="opset1">
			<data element_type="f16" offset="158820" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="102" name="145/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="145/fq_weights_1/Convert_to_float/Cast_02348_const" type="Const" version="opset1">
			<data element_type="u8" offset="158822" shape="128,64,3,3" size="73728"/>
			<output>
				<port id="1" precision="U8">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="145/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="145/fq_weights_1/Copy/out_low2030_const" type="Const" version="opset1">
			<data element_type="f16" offset="9424" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="145/fq_weights_1/Copy/out_high2031_const" type="Const" version="opset1">
			<data element_type="f16" offset="9426" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="794798_const" type="Const" version="opset1">
			<data element_type="f16" offset="232550" shape="128,1,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="795799_const" type="Const" version="opset1">
			<data element_type="f16" offset="232806" shape="128,1,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="145/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="145" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="data_add_37553760/copy_const167_const" type="Const" version="opset1">
			<data element_type="f16" offset="233062" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="146/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="147" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="492496_const" type="Const" version="opset1">
			<data element_type="f16" offset="9424" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="115" name="493497_const" type="Const" version="opset1">
			<data element_type="f16" offset="233318" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="116" name="494498_const" type="Const" version="opset1">
			<data element_type="f16" offset="9424" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="117" name="495499_const" type="Const" version="opset1">
			<data element_type="f16" offset="233318" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="118" name="148/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="148/fq_weights_1/Convert_to_float/Cast_02358_const" type="Const" version="opset1">
			<data element_type="u8" offset="233320" shape="128,128,3,3" size="147456"/>
			<output>
				<port id="1" precision="U8">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="148/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="148/fq_weights_1/Copy/out_low1982_const" type="Const" version="opset1">
			<data element_type="f16" offset="9424" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="148/fq_weights_1/Copy/out_high1983_const" type="Const" version="opset1">
			<data element_type="f16" offset="9426" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="504508_const" type="Const" version="opset1">
			<data element_type="f16" offset="380776" shape="128,1,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="505509_const" type="Const" version="opset1">
			<data element_type="f16" offset="381032" shape="128,1,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="148/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="148" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="data_add_37633768/copy_const172_const" type="Const" version="opset1">
			<data element_type="f16" offset="381288" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="149/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="802806_const" type="Const" version="opset1">
			<data element_type="f16" offset="381544" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="130" name="803807_const" type="Const" version="opset1">
			<data element_type="f16" offset="381546" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="131" name="804808_const" type="Const" version="opset1">
			<data element_type="f16" offset="381544" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="132" name="805809_const" type="Const" version="opset1">
			<data element_type="f16" offset="381546" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="133" name="152/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
				<port id="1"/>
				<port id="2"/>
				<port id="3"/>
				<port id="4"/>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="150/fq_weights_1/Convert_to_float/Cast_02338_const" type="Const" version="opset1">
			<data element_type="u8" offset="381548" shape="128,64,1,1" size="8192"/>
			<output>
				<port id="1" precision="U8">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="150/fq_weights_1/Convert_to_float" type="Convert" version="opset1">
			<data destination_type="f16"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="150/fq_weights_1/Copy/out_low1934_const" type="Const" version="opset1">
			<data element_type="f16" offset="9424" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="150/fq_weights_1/Copy/out_high1935_const" type="Const" version="opset1">
			<data element_type="f16" offset="9426" shape="1" size="2"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="444448_const" type="Const" version="opset1">
			<data element_type="f16" offset="389740" shape="128,1,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="445449_const" type="Const" version="opset1">
			<data element_type="f16" offset="389996" shape="128,1,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="150/fq_weights_1" type="FakeQuantize" version="opset1">
			<data levels="255"/>
			<input>
				<port id="0">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
				<port id="2">
					<dim>1</dim>
				</port>
				<port id="3">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="4">
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="150" type="Convolution" version="opset1">
			<data dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="142" name="data_add_37473752/copy_const176_const" type="Const" version="opset1">
			<data element_type="f16" offset="390252" shape="1,128,1,1" size="256"/>
			<output>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="143" name="151/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>9</dim>
					<dim>9</dim>
				</port>
			</output>
		</layer>
		<layer id="144" name="812816_const" type="Const" version="opset1">
			<data element_type="f16" offset="390508" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="145" name="813817_const" type="Const" version="opset1">
			<data element_type="f16" offset="390510" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="146" name="814818_const" type="Const" version="opset1">
			<data element_type="f16" offset="390508" shape="" size="2"/>
			<output>
				<port id="1" precision="FP16"/>
			</output>
		</layer>
		<layer id="147" name="815819_const" type="Const" version="opset1">
			<data element_type="f16" offset="390510" shape="" size="2"/>
